trade_exp/src/InformationRegisters/СостоянияОтгрузкиНакладных/СостоянияОтгрузкиНакладных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5a5841d-7829-4a6c-886f-fa90cf6b515c">
  <name>СостоянияОтгрузкиНакладных</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ТоварыКОтгрузкеПоНакладным/ТоварыКОтгрузкеПоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a7c328ab-741c-45d7-9358-9e9e38812c91">
  <name>ТоварыКОтгрузкеПоНакладным</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="0cf14db5-9afb-4948-b11a-12138b0ee922">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bbd1900a-29a4-445d-9f1c-ea3775c0e9f6">
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4b452df3-7133-4e55-9036-8fcfa449831c">
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0d983be1-230e-4f78-b0a8-b1da22c6cb48">
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d496068a-6125-46e9-8c4b-05cd1c0ebd11">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="06f44b51-790f-402b-9322-670f9278520e">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1916584f-206a-41b2-8d56-0f3e368caef4">
    <name>Накладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dfd24a1b-5813-48ea-8c9e-ceac25d8ae40">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6d6ffb46-19b4-45e8-a9f2-317588d2d551">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2c217449-34f6-457d-9a2c-d3442baf5298">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b3f9ea49-88ab-453f-b366-123391ee455c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="67f3c52a-2cbe-4ad5-b58c-0612ecf33693">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="609a7d44-d519-40cc-8ec3-a39f9057fb03">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5394523f-1d18-4bb7-94ac-c5f9ed62888e">
    <name>КОтбору</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2fcc0b73-2f07-413e-aa8c-c99b38f0655b">
    <name>Подготовлен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9a7f17cc-0bed-409a-bf22-547957e4b4a3">
    <name>КПроверке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92258e4f-ec60-44a5-9ef6-60af9d22d0f4">
    <name>ВПроцессеПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47a95af3-e94f-43dd-b105-b0009956fe02">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c578192a-6448-4799-ac7a-946fede4b1fa">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ac78645-99c6-4dd6-9e7a-1a60a918a880">
    <name>Накладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71e89e4b-8b80-42ba-ad22-143b0015eb7c">
    <name>ЯчейкаПромежуточногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29d823c9-7e0c-4440-a6f7-0759575e73ac">
    <name>ПричинаОтказаОтСборки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="488f5004-17e0-4162-b7a3-08a11e08045c">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="628b3ce2-4791-489a-9690-8cc51d7f27c4">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="71ec9ff7-b367-4f30-a98e-368c90e6ac5f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92946722-2614-4655-8fe5-999f3c499fd0">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/СостоянияОтгрузкиНакладных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Процедура ОбновитьСостояниеОтгрузкиНакладной(Накладная,Склад,РабочийУчасток=Неопределено) Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Накладная = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РабочийУчасток = Неопределено Тогда
		УдалениеЗаписейВРегистре(Накладная);
	КонецЕсли;
	
	ИспользуетсяОтгрузкаПоНакладным = АльтерраОбщегоНазначения.ОтгрузкаПоНакладным(Накладная.Дата,Склад);
	
	Если Не ИспользуетсяОтгрузкаПоНакладным Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПеремещение = ТипЗнч(Накладная.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаТаблицаСтатусовПоНакладным();   
	
	Запрос.УстановитьПараметр("РабочийУчасток", РабочийУчасток);
	Запрос.УстановитьПараметр("УсловиеПоСекции",Не РабочийУчасток=Неопределено);	
	Запрос.УстановитьПараметр("Накладная", Накладная.Ссылка);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ЭтоПеремещение Тогда
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
			ЗаписатьДанныеВРегистрПоЗаказам(ВыборкаДетальныеЗаписи);
		КонецЦикла;  
		
	Иначе
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаписатьДанныеВРегистр(ВыборкаДетальныеЗаписи);
		КонецЦикла;  
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры  

&НаСервере
Функция ТекстЗапросаТаблицаСтатусовПоНакладным()
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Склад КАК Склад,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.РабочийУчасток КАК РабочийУчасток,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Накладная КАК Накладная,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Заказ КАК Заказ,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Получатель КАК Получатель,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Назначение КАК Назначение,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.Серия КАК Серия,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.КОтгрузкеПриход КАК КОтгрузкеПриход,
	|	ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.КОтгрузкеРасход КАК КОтгрузкеРасход,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.КОтгрузкеКонечныйОстаток - ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.СобираетсяКонечныйОстаток - ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.СобраноКонечныйОстаток > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОжидаетсяОтбор,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.СобираетсяКонечныйОстаток > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Набирается,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.СобраноКонечныйОстаток > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Набран,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.КОтгрузкеКонечныйОстаток < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ошибка
	|ПОМЕСТИТЬ ПромежуточнаяТаблица
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузкеПоНакладным.ОстаткиИОбороты(, , , , Накладная = &Накладная) КАК ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &УсловиеПоСекции
	|				ТОГДА ТоварыКОтгрузкеПоНакладнымОстаткиИОбороты.РабочийУчасток = &РабочийУчасток
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьОрдер,
	|	РасходныйОрдерНаТовары.Накладная КАК Накладная,
	|	РасходныйОрдерНаТовары.РабочийУчасток КАК РабочийУчасток
	|ПОМЕСТИТЬ ОрдераВСтатусеОтгружен
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|ГДЕ
	|	РасходныйОрдерНаТовары.Проведен
	|	И РасходныйОрдерНаТовары.Накладная = &Накладная
	|	И РасходныйОрдерНаТовары.Статус = &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЧекККМ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтметкаКассы,
	|	ЧекККМНарезка.Ссылка КАК ЕстьНарезка,
	|	ЧекККМ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОтметкаКассыНарезка
	|ИЗ
	|	Документ.ЧекККМ.Нарезка КАК ЧекККМНарезка
	|		ПРАВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМНарезка.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМ.Ссылка = &Накладная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	РеализацияТоваровУслугНарезка.Ссылка,
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Нарезка КАК РеализацияТоваровУслугНарезка
	|		ПРАВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслугНарезка.Ссылка = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Накладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточнаяТаблица.Склад КАК Склад,
	|	ПромежуточнаяТаблица.РабочийУчасток КАК РабочийУчасток,
	|	ПромежуточнаяТаблица.Накладная КАК Документ,
	|	ПромежуточнаяТаблица.Заказ КАК Заказ,
	|	ПромежуточнаяТаблица.Получатель КАК Получатель,
	|	МАКСИМУМ(ПромежуточнаяТаблица.ОжидаетсяОтбор) КАК ОжидаетсяОтбор,
	|	МАКСИМУМ(ПромежуточнаяТаблица.Набирается) КАК Набирается,
	|	МАКСИМУМ(ПромежуточнаяТаблица.Набран) КАК Набран,
	|	МАКСИМУМ(ПромежуточнаяТаблица.Ошибка) КАК Ошибка,
	|	МАКСИМУМ(ЕСТЬNULL(ОрдераВСтатусеОтгружен.ЕстьОрдер, ЛОЖЬ)) КАК ЕстьОрдер,
	|	МАКСИМУМ(ЕСТЬNULL(ОтметкаКассыНарезка.ОтметкаКассы, ИСТИНА)) КАК ОтметкаКассы,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтметкаКассыНарезка.ЕстьНарезка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьНарезка
	|ИЗ
	|	ПромежуточнаяТаблица КАК ПромежуточнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОрдераВСтатусеОтгружен КАК ОрдераВСтатусеОтгружен
	|		ПО ПромежуточнаяТаблица.Накладная = ОрдераВСтатусеОтгружен.Накладная
	|			И ПромежуточнаяТаблица.РабочийУчасток = ОрдераВСтатусеОтгружен.РабочийУчасток
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтметкаКассыНарезка КАК ОтметкаКассыНарезка
	|		ПО (ОтметкаКассыНарезка.Ссылка = ПромежуточнаяТаблица.Накладная)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПромежуточнаяТаблица.Склад,
	|	ПромежуточнаяТаблица.РабочийУчасток,
	|	ПромежуточнаяТаблица.Накладная,
	|	ПромежуточнаяТаблица.Заказ,
	|	ПромежуточнаяТаблица.Получатель";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаписатьДанныеВРегистр(ДанныеЗаписи)
	
	Набор = РегистрыСведений.СостоянияОтгрузкиНакладных.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(ДанныеЗаписи.Документ);  
	Набор.Отбор.Склад.Установить(ДанныеЗаписи.Склад);  
	Набор.Отбор.РабочийУчасток.Установить(ДанныеЗаписи.РабочийУчасток);
	
	НоваяЗапись = Набор.Добавить(); 
	
	ЗаполнитьЗначенияСвойств(НоваяЗапись,ДанныеЗаписи);
	
	Если НЕ (НоваяЗапись.ОжидаетсяОтбор ИЛИ НоваяЗапись.Набирается ИЛИ  НоваяЗапись.Набран) Тогда
		НоваяЗапись.Отгружен = Истина;
		НоваяЗапись.ЧастичноОтгружен = Ложь;
	ИначеЕсли ДанныеЗаписи.ЕстьОрдер Тогда
		НоваяЗапись.ЧастичноОтгружен = Истина;
		НоваяЗапись.Отгружен = Ложь;
	Иначе 
		НоваяЗапись.Отгружен = Ложь;
		НоваяЗапись.ЧастичноОтгружен = Ложь;
	КонецЕсли;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВРегистрПоЗаказам(ДанныеЗаписи)
	
	Набор = РегистрыСведений.СостоянияОтгрузкиНакладных.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(ДанныеЗаписи.Документ);  
	Набор.Отбор.Склад.Установить(ДанныеЗаписи.Склад);  
	Набор.Отбор.РабочийУчасток.Установить(ДанныеЗаписи.РабочийУчасток);
	Набор.Отбор.Заказ.Установить(ДанныеЗаписи.Заказ); 
	
	НоваяЗапись = Набор.Добавить(); 
	
	ЗаполнитьЗначенияСвойств(НоваяЗапись,ДанныеЗаписи);
	
	Если НЕ (НоваяЗапись.ОжидаетсяОтбор ИЛИ НоваяЗапись.Набирается ИЛИ  НоваяЗапись.Набран) Тогда
		НоваяЗапись.Отгружен = Истина;
		НоваяЗапись.ЧастичноОтгружен = Ложь;
	ИначеЕсли ДанныеЗаписи.ЕстьОрдер Тогда
		НоваяЗапись.ЧастичноОтгружен = Истина;
		НоваяЗапись.Отгружен = Ложь;
	Иначе 
		НоваяЗапись.Отгружен = Ложь;
		НоваяЗапись.ЧастичноОтгружен = Ложь;
	КонецЕсли;
	
	Набор.Записать(Истина);
	
КонецПроцедуры
&НаСервере
Процедура ПриИзмененииСкладаИлиНесколькоЗаказов(Накладная,Склад,НесколькоЗаказов=Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Истина КАК Проверка
	|ИЗ
	|	РегистрСведений.СостоянияОтгрузкиНакладных КАК СостоянияОтгрузкиНакладных
	|ГДЕ
	|	СостоянияОтгрузкиНакладных.Документ = &Накладная 
	|   И Не СостоянияОтгрузкиНакладных.Склад = &Склад";

	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("Склад", Склад);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() ИЛИ НесколькоЗаказов Тогда 
		УдалениеЗаписейВРегистре(Накладная);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УдалениеЗаписейВРегистре(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.СостоянияОтгрузкиНакладных.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Документ.Ссылка);
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Набор.Очистить();
		Набор.Записать(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);   
	
КонецПроцедуры


#КонецЕсли
